DiplomD/src/Documents/ПромежуточнаяАттестация/ПромежуточнаяАттестация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПромежуточнаяАттестация</name>
  <registerRecords>AccumulationRegister.РейтингСтудентов</registerRecords>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.РабочаяПрограммаДисцилины</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>CatalogRef.ФормыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильНаправления</name>
    <type>
      <types>CatalogRef.ПрофилиНаправления</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДисциплины</name>
    <type>
      <types>CatalogRef.ОбъемыПромежуточнойАттестации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАттестации</name>
    <type>
      <types>EnumRef.ВидыромежуточнойАттестации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПланПроведенияПромежуточнойАттестации</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.ПреподавательскийСостав</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧ</name>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.СписокСтудентов</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗачетнойКнижки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БаллПромежуточнойАттестации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DiplomD/src/Catalogs/Группы/Группы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Группы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Кафедра</name>
    <type>
      <types>CatalogRef.Кафедры</types>
    </type>
  </attributes>
  <attributes>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.ПреподавательскийСостав</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>CatalogRef.ФормыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбразовательнаяПрограмма</name>
    <type>
      <types>CatalogRef.ОбразовательныеПрограммы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильНаправления</name>
    <type>
      <types>CatalogRef.ПрофилиНаправления</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УровеньОбразования</name>
    <type>
      <types>CatalogRef.УровниОбразования</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокОбучения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГодНачалаОбучения</name>
    <type>
      <types>EnumRef.ГодНачалаОбучения</types>
    </type>
  </attributes>
</mdclass:Catalog>

DiplomD/src/Documents/ПромежуточнаяАттестация/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ДисциплинаПриИзменении(Элемент)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура ГруппаПриИзмененииНаСервере()
	Спр = Справочники.Группы.НайтиПоНаименованию(Объект.Группа); 
	Объект.ФормаОбучения = Спр.ФормаОбучения; 
	Объект.ПрофильНаправления = Спр.ПрофильНаправления;
КонецПроцедуры

&НаКлиенте
Процедура ГруппаПриИзменении(Элемент)
	ГруппаПриИзмененииНаСервере();
КонецПроцедуры
